tinyNozzle/2D/5_with3outlets_cyclic_flush_01/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1000;

boundaryField
{

    inlet
    {
        type            fixedValue;
        value           uniform 1000;
    }

    outlet-1
    {
        type            inletOutlet;
        inletValue      uniform 1000;
        value           uniform 1000;
    }
    outlet-2
    {
        type            inletOutlet;
        inletValue      uniform 1000;
        value           uniform 1000;
    }

    wall
    {
        type            kqRWallFunction;
        value           uniform 1000;
    }

    frontAndBackPlanes
    {
        type            empty;
    }
    
}
// ************************************************************************* //
